# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [18]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.head(20)

    Unnamed: 0     Id       Name  Year Gender State  Count
0        11349  11350       Emma  2004      F    AK     62
1        11350  11351    Madison  2004      F    AK     48
2        11351  11352     Hannah  2004      F    AK     46
3        11352  11353      Grace  2004      F    AK     44
4        11353  11354      Emily  2004      F    AK     41
5        11354  11355    Abigail  2004      F    AK     37
6        11355  11356     Olivia  2004      F    AK     33
7        11356  11357   Isabella  2004      F    AK     30
8        11357  11358     Alyssa  2004      F    AK     29
9        11358  11359     Sophia  2004      F    AK     28
10       11359  11360     Alexis  2004      F    AK     27
11       11360  11361  Elizabeth  2004      F    AK     27
12       11361  11362     Hailey  2004      F    AK     27
13       11362  11363       Anna  2004      F    AK     26
14       11363  11364    Natalie  2004      F    AK     25
15       11364  11365      Sarah  2004      F    AK     25
16       11365  11366     Sydney  2004      F    AK     25
17       11366  11367        Ava  2004      F    AK     23
18       11367  11368    Trinity  2004      F    AK     22
19       11368  11369      Haley  2004      F    AK     21

### Step 4. See the first 10 entries

In [19]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [26]:
baby_names.drop(['Unnamed: 0','Id'],axis=1,inplace=True)
baby_names.head(5)

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [27]:
baby_names.groupby(['Gender'])['Name'].count()

Gender
F    558846
M    457549
Name: Name, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [28]:
names = baby_names.groupby(['Name'])
names

### Step 8. How many different names exist in the dataset?

In [29]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [35]:
most = baby_names.groupby('Name').sum()
most1 = most.sort_values(['Count'],ascending=False)
most1.head(1)

          Year   Count
Name
Jacob  1141099  242874

### Step 10. How many different names have the least occurrences?

In [36]:
least = baby_names.groupby(['Name']).count()
len(least[least.Count < 2])

3682

### Step 11. What is the median name occurrence?

In [39]:
group = baby_names.groupby(['Name']).sum()
group.median()['Count']

49.0

### Step 12. What is the standard deviation of names?

In [40]:
group.std()['Count']

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [41]:
stat = baby_names.describe()
stat

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03

In [42]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 5 columns):
Name      1016395 non-null object
Year      1016395 non-null int64
Gender    1016395 non-null object
State     1016395 non-null object
Count     1016395 non-null int64
dtypes: int64(2), object(3)
memory usage: 38.8+ MB